Tekla.Structures.Drawing.View.ViewMarkSymbolAttributes
The ViewMarkSymbolAttributes class contains symbol attributes for view mark tags.

Tekla.Structures.Drawing.View.ViewMarkSymbolAttributes.LineLengthType
The label line length type.

Tekla.Structures.Drawing.View.ViewMarkSymbolAttributes.LineLength
The label line length in the case of custom length.

Tekla.Structures.Drawing.View.ViewMarkSymbolAttributes.#ctor
Creates a new mark symbol attributes instance.

Tekla.Structures.Drawing.View.ViewMarkSymbolAttributes.#ctor(System.Double,Tekla.Structures.Drawing.MarkSymbolShape,Tekla.Structures.Drawing.View.LabelLineLengthType,System.Double)
Creates a new mark symbol attributes instance with the given size, shape, line length type and line length.
size: The size of the mark symbol to be used.
shape: The shape of the mark symbol to be used.
lineLengthType: The line length type of the mark symbol to be used.
lineLength: The line length of the mark symbol to be used.

Tekla.Structures.Drawing.View.ViewMarkSymbolAttributes.IsEqual(System.Object)
Compares the current object with an object of the same type.
ObjectToCompare: The object to be used for comparing.
Returns: True if all the fields (except for the database GUID) of the objects match.